In [19]:
import pandas as pd
from matplotlib import pyplot as plt
import seaborn as sns
import numpy as np
from sqlalchemy import create_engine, types
from sqlalchemy import text # to be able to pass string

In [23]:
df_1= pd.read_csv('../data/Raw/World_Marriage_Dataset.csv')

In [24]:
df_1.sample(10)

,Sr.No.,Country,AgeGroup,Sex,MaritalStatus,DataProcess,Data Collection (Start Year),Data Collection (End Year),Data Source
138285,138286,Latvia,[35-39],Man,Widowed,Census,2000,2000,UNSD
105075,105076,Hungary,[15-19],Woman,Divorced,Estimate,1984,1984,UNSD
168366,168367,Nepal,[35-39],Woman,Divorced,Survey,2006,2006,DHS_STATcompiler
68280,68281,Ecuador,[15-19],Man,Separated,Census,2010,2010,UNSD
60166,60167,Denmark,[10-14],Woman,Widowed,Estimate,1976,1976,UNSD
180297,180298,Norway,[50-54],Woman,Single,Census,1970,1970,UNSD
245939,245940,Togo,[20-24],Man,Widowed,Survey,2017,2017,National statistics
111351,111352,Iceland,[75+],Woman,Divorced,Estimate,1987,1987,UNSD
30341,30342,Cambodia,[15-19],Man,Divorced,Survey,2014,2014,DHS_STATcompiler
46781,46782,Comoros,[15-19],Woman,Divorced,Survey,2012,2012,DHS_HH

In [25]:
df_1.drop(columns=["Sr.No."], inplace=True)

In [26]:
df_1

,Country,AgeGroup,Sex,MaritalStatus,DataProcess,Data Collection (Start Year),Data Collection (End Year),Data Source
0,Afghanistan,[15-19],Man,Divorced,Survey,1972,1974,National statistics
1,Afghanistan,[20-24],Man,Divorced,Survey,1972,1974,National statistics
2,Afghanistan,[25-29],Man,Divorced,Survey,1972,1974,National statistics
3,Afghanistan,[30-34],Man,Divorced,Survey,1972,1974,National statistics
4,Afghanistan,[35-39],Man,Divorced,Survey,1972,1974,National statistics
...,...,...,...,...,...,...,...,...
271599,Zimbabwe,[55-59],Woman,Widowed,Survey,2017,2017,National statistics
271600,Zimbabwe,[60-64],Woman,Widowed,Survey,2017,2017,National statistics
271601,Zimbabwe,[65-69],Woman,Widowed,Survey,2017,2017,National statistics
271602,Zimbabwe,[70-74],Woman,Widowed,Survey,2017,2017,National statistics
271603,Zimbabwe,[75+],Woman,Widowed,Survey,2017,2017,National statistics

In [27]:
df_1.columns = df.columns.str.lower() \
    .str.replace(' ', '_') \
    .str.replace('(', '') \
    .str.replace(')', '') \
    .str.replace('[^0-9a-zA-Z_]', '', regex=True)

In [28]:
df_1.rename(columns={
    "agegroup": "age_group",
    "maritalstatus": "marital_status",
    "dataprocess": "data_process",
    "Data Collection (Start Year)": "data_collection_start_year",
    "Data Collection (End Year)": "data_collection_end_year",
    "Data Source": "data_source",
    "Country": "country",
    "Sex": "sex"
}, inplace=True)

In [29]:
df_1.sample(5)

,country,age_group,sex,marital_status,data_process,data_collection_start_year,data_collection_end_year,data_source
37174,Cayman Islands,[20-24],Man,Separated,Census,2010,2010,UNSD
175745,New Zealand,[45-49],Man,Single,Census,1996,1996,UNSD
14667,Barbados,[65-69],Woman,Single,Census,2010,2010,UNSD
212588,San Marino,[75+],Woman,Widowed,Estimate,2003,2003,UNSD
216452,Senegal,[75+],Man,Divorced,Survey,2012,2014,DHS_HH

In [30]:
df_1.drop_duplicates(inplace=True)
print(df.isnull().sum())

country                       0
age_group                     0
sex                           0
marital_status                0
data_process                  0
data_collection_start_year    0
data_collection_end_year      0
data_source                   0
dtype: int64

In [31]:
print(df_1.head())

       country age_group  sex marital_status data_process  \
0  Afghanistan   [15-19]  Man       Divorced       Survey
1  Afghanistan   [20-24]  Man       Divorced       Survey
2  Afghanistan   [25-29]  Man       Divorced       Survey
3  Afghanistan   [30-34]  Man       Divorced       Survey
4  Afghanistan   [35-39]  Man       Divorced       Survey

   data_collection_start_year  data_collection_end_year          data_source
0                        1972                      1974  National statistics
1                        1972                      1974  National statistics
2                        1972                      1974  National statistics
3                        1972                      1974  National statistics
4                        1972                      1974  National statistics

In [32]:
df_1.to_csv("cleaned_world_marriage.csv", index=False)

In [35]:
df_2 = pd.read_csv('../data/Raw/age-at-marriage-women.csv')
df_2.sample(5)

,Entity,Code,Year,Mean age of women at first marriage,1005564-annotations
461,Israel,ISR,2016,25.1,NaN
520,Japan,JPN,2016,29.4,NaN
338,Germany,DEU,2006,29.1,NaN
667,New Zealand,NZL,2004,28.1,median
47,Austria,AUT,2006,29.1,NaN

In [37]:
df_2.columns = df_2.columns.str.lower() \
    .str.replace(' ', '_') \
    .str.replace('(', '') \
    .str.replace(')', '') \
    .str.replace('[^0-9a-zA-Z_]', '', regex=True)

In [38]:
df_2

,entity,code,year,mean_age_of_women_at_first_marriage,1005564annotations
0,Australia,AUS,1990,24.3,median
1,Australia,AUS,1991,24.5,median
2,Australia,AUS,1992,24.7,median
3,Australia,AUS,1993,24.8,median
4,Australia,AUS,1994,25.1,median
...,...,...,...,...,...
1042,United States,USA,2017,27.4,median
1043,United States,USA,2018,27.8,median
1044,United States,USA,2019,28.0,median
1045,United States,USA,2020,28.1,median
1046,United States,USA,2021,28.6,median

In [42]:
df_cleaned_2 = df_2.drop(columns=['1005564annotations'])

# Rename long column
df_cleaned_2.rename(columns={
    'Mean age of women at first marriage': 'mean_age_first_marriage'
}, inplace=True)

# Optional: Save cleaned version
df_cleaned_2.to_csv("cleaned_age_at_marriage_women.csv", index=False)

In [ ]:
df_cleaned_2

             entity code  year  mean_age_of_women_at_first_marriage
0         Australia  AUS  1990                                 24.3
1         Australia  AUS  1991                                 24.5
2         Australia  AUS  1992                                 24.7
3         Australia  AUS  1993                                 24.8
4         Australia  AUS  1994                                 25.1
...             ...  ...   ...                                  ...
1042  United States  USA  2017                                 27.4
1043  United States  USA  2018                                 27.8
1044  United States  USA  2019                                 28.0
1045  United States  USA  2020                                 28.1
1046  United States  USA  2021                                 28.6

[1047 rows x 4 columns]